load-test/test-carts-updateQuantity.yaml
config:
  target: 'http://localhost:3000/api'
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: Warm up phase
    - duration: 60
      arrivalRate: 100
      rampTo: 150
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      rampTo: 30
      name: Spike phase
  # plugins:
  #     ensure: {}
  #     apdex: {}
  #     metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
  payload:
    path: "fake_data_cart.csv"
    fields: 
        - "cartId"
        - "goodsId"
        - "createCartDtoCtCount"
        - "updateCount"
        - "accessToken"

scenarios:
  - name: "3-3. [Carts][updateQuantity] - 10,000VUs"
    flow:
      - log: "{{ cartId }}, {{ accessToken }}, {{ updateCount }}"
      - patch:
          url: "/cart/update/{{ cartId }}"
          cookie:
            authorization: "{{ accessToken }}"
          json: 
            count: "{{ updateCount }}"